Revit 2024 API
DocumentValidation.CanDeleteElement Method
 Indicates if an element can be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static bool CanDeleteElement(
	Document document,
	ElementId elementId
)
Visual Basic
Public Shared Function CanDeleteElement ( _
	document As Document, _
	elementId As ElementId _
) As Boolean
Visual C++
public:
static bool CanDeleteElement(
	Document^ document,
	ElementId^ elementId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
elementId
Type: Autodesk.Revit.DB.ElementId
 The id of the element to check.
Return Value
 True if the element can be deleted, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DocumentValidation Class
Autodesk.Revit.DB Namespace